ChargePoint/emb-uboot-imx/board/freescale/imx8qxp_ucb/pin_mux.c
  - {pin_num: AD28, peripheral: SCU__JTAG, signal: jtag_trst_b, pin_signal: JTAG_TRST_B}
  - {pin_num: AJ33, peripheral: SCU__DSC, signal: dsc_pmic_int_b, pin_signal: PMIC_INT_B}
  - {pin_num: AJ19, peripheral: MIPI_DSI0, signal: mipi_dsi_ckn, pin_signal: MIPI_DSI0_CLK_N}
  - {pin_num: AK20, peripheral: MIPI_DSI0, signal: mipi_dsi_ckp, pin_signal: MIPI_DSI0_CLK_P}
  - {pin_num: AJ21, peripheral: MIPI_DSI0, signal: 'mipi_dsi_dn, 0', pin_signal: MIPI_DSI0_DATA0_N}
  - {pin_num: AK22, peripheral: MIPI_DSI0, signal: 'mipi_dsi_dp, 0', pin_signal: MIPI_DSI0_DATA0_P}
  - {pin_num: AJ17, peripheral: MIPI_DSI0, signal: 'mipi_dsi_dn, 1', pin_signal: MIPI_DSI0_DATA1_N}
  - {pin_num: AK18, peripheral: MIPI_DSI0, signal: 'mipi_dsi_dp, 1', pin_signal: MIPI_DSI0_DATA1_P}
  - {pin_num: AJ23, peripheral: MIPI_DSI0, signal: 'mipi_dsi_dn, 2', pin_signal: MIPI_DSI0_DATA2_N}
  - {pin_num: AK24, peripheral: MIPI_DSI0, signal: 'mipi_dsi_dp, 2', pin_signal: MIPI_DSI0_DATA2_P}
  - {pin_num: AJ15, peripheral: MIPI_DSI0, signal: 'mipi_dsi_dn, 3', pin_signal: MIPI_DSI0_DATA3_N}
  - {pin_num: AK16, peripheral: MIPI_DSI0, signal: 'mipi_dsi_dp, 3', pin_signal: MIPI_DSI0_DATA3_P}
  - {pin_num: AR19, peripheral: MIPI_CSI0, signal: 'mipi_csi_dp, 3', pin_signal: MIPI_CSI0_DATA3_P}
  - {pin_num: AN19, peripheral: MIPI_CSI0, signal: 'mipi_csi_dn, 3', pin_signal: MIPI_CSI0_DATA3_N}
  - {pin_num: AR23, peripheral: MIPI_CSI0, signal: 'mipi_csi_dp, 2', pin_signal: MIPI_CSI0_DATA2_P}
  - {pin_num: AN23, peripheral: MIPI_CSI0, signal: 'mipi_csi_dn, 2', pin_signal: MIPI_CSI0_DATA2_N}
  - {pin_num: AP20, peripheral: MIPI_CSI0, signal: 'mipi_csi_dp, 1', pin_signal: MIPI_CSI0_DATA1_P}
  - {pin_num: AM20, peripheral: MIPI_CSI0, signal: 'mipi_csi_dn, 1', pin_signal: MIPI_CSI0_DATA1_N}
  - {pin_num: AP22, peripheral: MIPI_CSI0, signal: 'mipi_csi_dp, 0', pin_signal: MIPI_CSI0_DATA0_P}
  - {pin_num: AM22, peripheral: MIPI_CSI0, signal: 'mipi_csi_dn, 0', pin_signal: MIPI_CSI0_DATA0_N}
  - {pin_num: AR21, peripheral: MIPI_CSI0, signal: mipi_csi_ckp, pin_signal: MIPI_CSI0_CLK_P}
  - {pin_num: AN21, peripheral: MIPI_CSI0, signal: mipi_csi_ckn, pin_signal: MIPI_CSI0_CLK_N}
  - {pin_num: AP26, peripheral: MIPI_CSI0__I2C0, signal: i2c_scl, pin_signal: MIPI_CSI0_I2C0_SCL}
  - {pin_num: AM24, peripheral: MIPI_CSI0__I2C0, signal: i2c_sda, pin_signal: MIPI_CSI0_I2C0_SDA}
  - {pin_num: AN25, peripheral: MIPI_CSI0__ACM, signal: mclk_out, pin_signal: MIPI_CSI0_MCLK_OUT}
  - {pin_num: F12, peripheral: HSIO__PCIE_IOB, signal: pcie_iob_ref_qr, pin_signal: PCIE_REF_QR}
  - {pin_num: AH28, peripheral: SNVS, signal: snvs_on_off_button, pin_signal: ON_OFF_BUTTON}
  - {pin_num: AL35, peripheral: SCU__DSC, signal: dsc_test_out_p, pin_signal: ANA_TEST_OUT_P}
  - {pin_num: AK34, peripheral: SCU__DSC, signal: dsc_test_out_n, pin_signal: ANA_TEST_OUT_N}
  - {pin_num: U31, peripheral: ADC, signal: adc_vrefl, pin_signal: ADC_VREFL}
  - {pin_num: U29, peripheral: ADC, signal: adc_vrefh, pin_signal: ADC_VREFH}
  - {pin_num: AP18, peripheral: MIPI_DSI1, signal: 'mipi_dsi_dp, 3', pin_signal: MIPI_DSI1_DATA3_P}
  - {pin_num: AM18, peripheral: MIPI_DSI1, signal: 'mipi_dsi_dn, 3', pin_signal: MIPI_DSI1_DATA3_N}
  - {pin_num: AP14, peripheral: MIPI_DSI1, signal: 'mipi_dsi_dp, 2', pin_signal: MIPI_DSI1_DATA2_P}
  - {pin_num: AM14, peripheral: MIPI_DSI1, signal: 'mipi_dsi_dn, 2', pin_signal: MIPI_DSI1_DATA2_N}
  - {pin_num: AR17, peripheral: MIPI_DSI1, signal: 'mipi_dsi_dp, 1', pin_signal: MIPI_DSI1_DATA1_P}
  - {pin_num: AN17, peripheral: MIPI_DSI1, signal: 'mipi_dsi_dn, 1', pin_signal: MIPI_DSI1_DATA1_N}
  - {pin_num: AR15, peripheral: MIPI_DSI1, signal: 'mipi_dsi_dp, 0', pin_signal: MIPI_DSI1_DATA0_P}
  - {pin_num: AN15, peripheral: MIPI_DSI1, signal: 'mipi_dsi_dn, 0', pin_signal: MIPI_DSI1_DATA0_N}
  - {pin_num: AP16, peripheral: MIPI_DSI1, signal: mipi_dsi_ckp, pin_signal: MIPI_DSI1_CLK_P}
  - {pin_num: AM16, peripheral: MIPI_DSI1, signal: mipi_dsi_ckn, pin_signal: MIPI_DSI1_CLK_N}
  - {pin_num: AG29, peripheral: SCU__DSC, signal: dsc_pmic_standby, pin_signal: SCU_PMIC_STANDBY}
  - {pin_num: E23, peripheral: CONN__USDHC1, signal: usdhc_cd_b, pin_signal: USDHC1_CD_B}
  - {pin_num: G23, peripheral: CONN__USDHC1, signal: usdhc_clk, pin_signal: USDHC1_CLK}
  - {pin_num: C25, peripheral: CONN__USDHC1, signal: usdhc_cmd, pin_signal: USDHC1_CMD}
  - {pin_num: A27, peripheral: CONN__USDHC1, signal: 'usdhc_data, 0', pin_signal: USDHC1_DATA0}
  - {pin_num: D26, peripheral: CONN__USDHC1, signal: 'usdhc_data, 2', pin_signal: USDHC1_DATA2}
  - {pin_num: E25, peripheral: CONN__USDHC1, signal: 'usdhc_data, 3', pin_signal: USDHC1_DATA3}
  - {pin_num: B24, peripheral: CONN__USDHC1, signal: usdhc_reset_b, pin_signal: USDHC1_RESET_B}
  - {pin_num: A25, peripheral: CONN__USDHC1, signal: usdhc_vselect, pin_signal: USDHC1_VSELECT}
  - {pin_num: D24, peripheral: CONN__USDHC1, signal: usdhc_wp, pin_signal: USDHC1_WP}
  - {pin_num: V34, peripheral: ADMA__ADC, signal: 'adc_in, 5', pin_signal: ADC_IN5}
  - {pin_num: W29, peripheral: ADMA__ADC, signal: 'adc_in, 4', pin_signal: ADC_IN4}
  - {pin_num: V30, peripheral: ADMA__ADC, signal: 'adc_in, 3', pin_signal: ADC_IN3}
  - {pin_num: V32, peripheral: ADMA__ADC, signal: 'adc_in, 2', pin_signal: ADC_IN2}
  - {pin_num: B26, peripheral: CONN__USDHC1, signal: 'usdhc_data, 1', pin_signal: USDHC1_DATA1}
  - {pin_num: AB34, peripheral: ADMA__UART3, signal: uart_rx, pin_signal: FLEXCAN2_RX}
  - {pin_num: AC35, peripheral: ADMA__UART2, signal: uart_tx, pin_signal: UART2_TX}
  - {pin_num: AD34, peripheral: ADMA__UART2, signal: uart_rx, pin_signal: UART2_RX}
  - {pin_num: F14, peripheral: CONN__USB_OTG1, signal: usb_otg_pwr, pin_signal: USB_SS3_TC0}
  - {pin_num: G15, peripheral: CONN__USB_OTG1, signal: usb_otg_oc, pin_signal: USB_SS3_TC2}
  - {pin_num: M34, peripheral: ADMA__SAI0, signal: sai_rxd, pin_signal: SAI0_RXD}
  - {pin_num: K34, peripheral: ADMA__SAI0, signal: sai_txd, pin_signal: SAI0_TXD}
  - {pin_num: L33, peripheral: ADMA__SAI0, signal: sai_txfs, pin_signal: SAI0_TXFS}
  - {pin_num: J35, peripheral: ADMA__SAI0, signal: sai_txc, pin_signal: SAI0_TXC}
  - {pin_num: L29, peripheral: ADMA__ACM, signal: 'acm_mclk_out, 0', pin_signal: MCLK_OUT0}
  - {pin_num: H14, peripheral: ADMA__I2C1, signal: i2c_scl, pin_signal: USB_SS3_TC1}
  - {pin_num: C15, peripheral: ADMA__I2C1, signal: i2c_sda, pin_signal: USB_SS3_TC3}
  - {pin_num: AD30, peripheral: ADMA__I2C2, signal: i2c_scl, pin_signal: MIPI_DSI1_GPIO0_00}
  - {pin_num: AF34, peripheral: ADMA__I2C2, signal: i2c_sda, pin_signal: MIPI_DSI1_GPIO0_01}
  - {pin_num: K30, peripheral: ADMA__I2C3, signal: i2c_scl, pin_signal: SPI3_CS1}
  - {pin_num: M28, peripheral: ADMA__I2C3, signal: i2c_sda, pin_signal: MCLK_IN1}
  - {pin_num: AR25, peripheral: MIPI_CSI0__GPIO0, signal: 'gpio_io, 00', pin_signal: MIPI_CSI0_GPIO0_00}
  - {pin_num: AP24, peripheral: MIPI_CSI0__GPIO0, signal: 'gpio_io, 01', pin_signal: MIPI_CSI0_GPIO0_01}
  - {pin_num: N29, peripheral: ADMA__UART1, signal: uart_rts_b, pin_signal: UART1_RTS_B}
  - {pin_num: K32, peripheral: ADMA__UART1, signal: uart_cts_b, pin_signal: UART1_CTS_B}
  - {pin_num: R33, peripheral: LSIO__GPIO1, signal: 'gpio_io, 08', pin_signal: SPI0_CS0}
  - {pin_num: R35, peripheral: LSIO__GPIO1, signal: 'gpio_io, 07', pin_signal: SPI0_CS1}
  - {pin_num: P30, peripheral: LSIO__GPIO1, signal: 'gpio_io, 04', pin_signal: SPI0_SCK}
  - {pin_num: P34, peripheral: LSIO__GPIO1, signal: 'gpio_io, 05', pin_signal: SPI0_SDI}
  - {pin_num: R31, peripheral: LSIO__GPIO1, signal: 'gpio_io, 06', pin_signal: SPI0_SDO}
  - {pin_num: P28, peripheral: LSIO__GPIO1, signal: 'gpio_io, 00', pin_signal: SPI2_CS0}
  - {pin_num: R29, peripheral: LSIO__GPIO1, signal: 'gpio_io, 03', pin_signal: SPI2_SCK}
  - {pin_num: N31, peripheral: LSIO__GPIO1, signal: 'gpio_io, 02', pin_signal: SPI2_SDI}
  - {pin_num: P32, peripheral: LSIO__GPIO1, signal: 'gpio_io, 01', pin_signal: SPI2_SDO}
  - {pin_num: M32, peripheral: LSIO__GPIO0, signal: 'gpio_io, 29', pin_signal: SAI1_RXD}
  - {pin_num: N35, peripheral: LSIO__GPIO0, signal: 'gpio_io, 31', pin_signal: SAI1_RXFS}
  - {pin_num: J31, peripheral: LSIO__GPIO0, signal: 'gpio_io, 16', pin_signal: SPI3_CS0}
  - {pin_num: H32, peripheral: LSIO__GPIO0, signal: 'gpio_io, 13', pin_signal: SPI3_SCK}
  - {pin_num: G33, peripheral: LSIO__GPIO0, signal: 'gpio_io, 15', pin_signal: SPI3_SDI}
  - {pin_num: F34, peripheral: LSIO__GPIO0, signal: 'gpio_io, 14', pin_signal: SPI3_SDO}
  - {pin_num: AM8, peripheral: LSIO__GPIO3, signal: 'gpio_io, 21', pin_signal: QSPI0B_DATA3}
  - {pin_num: AJ9, peripheral: LSIO__GPIO3, signal: 'gpio_io, 24', pin_signal: QSPI0B_SS1_B}
  - {pin_num: AL9, peripheral: LSIO__GPIO3, signal: 'gpio_io, 19', pin_signal: QSPI0B_DATA1}
  - {pin_num: AH10, peripheral: LSIO__GPIO3, signal: 'gpio_io, 23', pin_signal: QSPI0B_SS0_B}
  - {pin_num: AK10, peripheral: LSIO__GPIO3, signal: 'gpio_io, 22', pin_signal: QSPI0B_DQS}
  - {pin_num: AM10, peripheral: LSIO__GPIO3, signal: 'gpio_io, 18', pin_signal: QSPI0B_DATA0}
  - {pin_num: AJ11, peripheral: LSIO__GPIO3, signal: 'gpio_io, 20', pin_signal: QSPI0B_DATA2}
  - {pin_num: AL11, peripheral: LSIO__GPIO3, signal: 'gpio_io, 13', pin_signal: QSPI0A_DQS}
  - {pin_num: AR11, peripheral: LSIO__GPIO3, signal: 'gpio_io, 17', pin_signal: QSPI0B_SCLK}
  - {pin_num: AH12, peripheral: LSIO__GPIO3, signal: 'gpio_io, 12', pin_signal: QSPI0A_DATA3}
  - {pin_num: AK12, peripheral: LSIO__GPIO3, signal: 'gpio_io, 15', pin_signal: QSPI0A_SS1_B}
  - {pin_num: AM12, peripheral: LSIO__GPIO3, signal: 'gpio_io, 14', pin_signal: QSPI0A_SS0_B}
  - {pin_num: AP12, peripheral: LSIO__GPIO3, signal: 'gpio_io, 16', pin_signal: QSPI0A_SCLK}
  - {pin_num: AJ13, peripheral: LSIO__GPIO3, signal: 'gpio_io, 11', pin_signal: QSPI0A_DATA2}
  - {pin_num: AR13, peripheral: LSIO__GPIO3, signal: 'gpio_io, 10', pin_signal: QSPI0A_DATA1}
  - {pin_num: AK14, peripheral: LSIO__GPIO3, signal: 'gpio_io, 09', pin_signal: QSPI0A_DATA0}
  - {pin_num: AD32, peripheral: LSIO__GPIO1, signal: 'gpio_io, 27', pin_signal: MIPI_DSI0_GPIO0_00}
  - {pin_num: AE35, peripheral: LSIO__GPIO1, signal: 'gpio_io, 28', pin_signal: MIPI_DSI0_GPIO0_01}
  - {pin_num: AC31, peripheral: LSIO__GPIO1, signal: 'gpio_io, 25', pin_signal: MIPI_DSI0_I2C0_SCL}
  - {pin_num: AB28, peripheral: LSIO__GPIO1, signal: 'gpio_io, 26', pin_signal: MIPI_DSI0_I2C0_SDA}
  - {pin_num: AE33, peripheral: LSIO__GPIO1, signal: 'gpio_io, 29', pin_signal: MIPI_DSI1_I2C0_SCL}
  - {pin_num: AM26, peripheral: LSIO__GPIO3, signal: 'gpio_io, 01', pin_signal: CSI_MCLK}
  - {pin_num: AK26, peripheral: LSIO__GPIO3, signal: 'gpio_io, 00', pin_signal: CSI_PCLK}
  - {pin_num: AR27, peripheral: LSIO__GPIO3, signal: 'gpio_io, 03', pin_signal: CSI_RESET}
  - {pin_num: AP28, peripheral: LSIO__GPIO3, signal: 'gpio_io, 02', pin_signal: CSI_EN}
  - {pin_num: AC29, peripheral: LSIO__GPIO1, signal: 'gpio_io, 30', pin_signal: MIPI_DSI1_I2C0_SDA}
  - {pin_num: G35, peripheral: LSIO__GPIO0, signal: 'gpio_io, 19', pin_signal: MCLK_IN0}
  - {pin_num: AF28, peripheral: LSIO__GPIO2, signal: 'gpio_io, 03', pin_signal: SCU_GPIO0_00}
  - {pin_num: U35, peripheral: LSIO__GPIO1, signal: 'gpio_io, 10', pin_signal: ADC_IN0}
  - {pin_num: L35, peripheral: LSIO__GPIO0, signal: 'gpio_io, 30', pin_signal: SAI1_RXC}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

